#ifndef SPLIT_INPUT_H
#define SPLIT_INPUT_H

typedef enum{
    number,
    operator,
    function,
    s_parantes,
    e_parantes
} type;
// هدف این قسمت اینه که ما هر بخشی از ورودیمون رو از حالت استرینگ به یک
//شکلی که بشه باهاش محاسبه کرد تبدیل کنیم که اینجا ما نوع هر قسمت رو مشخص کردیم
typedef struct
{
    type noe; // نوع قسمت
    double number;// مقدار قسمت
    char *text_name;// اسم قسمت
} part;
// هر قسمت دارای یک نوع از انواعی که بالاتر تعیین کردیم هست برای مثال اگر 
//از نوع عدد باشد در قسمت نوع نامبر ذخیره میشه و در قسمت بعد اندازه ان
typedef struct
{
    part *items;
    int current;
    int maximum;
} part_list;
//در این قسمت چون نمیدانیم چند پارت به عنوان ورودی میگیریم یک لیستی از این
//پارت ها درست میکنیم که تعداد قسمت ها و تعداد قسمت هایی که حافظه اختصاص دادیم هست

part_list split(char *text);
// این تابع دونه دونه حرف های استرینگ ورودی را میخواند و به بخش های مختلف با معنی تقسیم میکند
#endif